{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Masking","config":{"mask_value":0,"name":"masking_Masking1","trainable":true,"batch_input_shape":[null,4,2061],"dtype":"float32"}},{"class_name":"RNN","config":{"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"cell":{"class_name":"StackedRNNCells","config":{"cells":[{"class_name":"LSTMCell","config":{"units":256,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell1","trainable":true}}],"name":"stacked_rnn_cells_StackedRNNCells1","trainable":true}},"name":"rnn_RNN1","trainable":true}},{"class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true}},{"class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}}]},"keras_version":"tfjs-layers 2.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.0.0","convertedBy":null,"weightsManifest":[{"paths":["./wyckoff-ai-model.weights.bin"],"weights":[{"name":"rnn_RNN1/RNNCell_0/kernel","shape":[2061,1024],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_0/recurrent_kernel","shape":[256,1024],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_0/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[256,3],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[3],"dtype":"float32"}]}]}